# ExportIFCCategoryTable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..ExportIFCCategoryTable Property
Application Class See Also
---
Full path to the file that defines Revit category to IFC entity mappings for IFC export.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string ExportIFCCategoryTable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ExportIFCCategoryTable As String
	Get
```

Visual C++
---
```text
public:
property String^ ExportIFCCategoryTable {
	String^ get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace